[
    {
        "main_icon": "case",
        "title": "Interned at SpeQtral",
        "remark": "under SGInnovate Summation Programme",
        "summary": "Worked on SpeQtral's QKD software stack",
        "img": "assets/png/spq.png",
        "divs": [
            { "icon": "time", "html": "~3 months"},
            { "icon": "tool", "html": "Bash, C, C++, Linux, Google Collab, Python"},
            { "icon": "case", "html": "<a target='blank' href='https://speqtral.space/'>SpeQtral</a>" },
            { "html": "During my 2nd year in NUS, I decided to participate in the SGInnovate Summation Programme and intern at SpeQtral during my summer break. <br><br>SpeQtral is a start-up company with expertise in satellite-based QKD based on technologies developed at the CQT. As advertised on their website, SpeQtral staff have been involved in demonstrations of entanglement-based QKD and daylight QKD and has successfully deployed an entangled photon source in a CubeSat in space. <br><br>SpeQtral has been using qCrypto, a collection of code written in C for entanglement-based quantum key distribution (QKD) on unix systems. The system is a suite of programs that allow two parties to produce a random symmetric key using the BB84 quantum cryptography protocol, as well as other as other discrete-variable QKD protocols such as BBM92. <br><br>While the system is functional and is in use by the Centre of Quantum Technologies (CQT) of the National University of Singapore (NUS), the code has not undergone significant changes for the last 6 – 12 years despite scientific advances in the field of QKD. <br><br>My work at SpeQtral was thus to improve the stack which includes the analysis of existing open-source implementations of QKD software stacks, analysis of the qCrypto stack itself. I also improved the stack in 3 main areas: better documentation of the stack, modularization of the error correction module and partial implementation of low-density parity check code (LDPC) for QKD purposes. <br><br>I am very grateful to SGInnovate and SpeQtral for offering me this opportunity to learn and contribute to their efforts in advancing quantum communication technologies based in Singapore, and the mentorship I received was outstanding. Thank you." }
        ]
    },
    {
        "main_icon": "paint",
        "title": "Panopto Plus",
        "remark": "Chrome Extension to optimize NUS webcasts",
        "summary": "Improves webcasts hosted on Panopto for NUS students",
        "img": "assets/png/panp.png",
        "divs": [
            { "icon": "ppl", "html": "1 man team" },
            { "icon": "time", "html": "1 summer break (~12 weeks)"},
            { "icon": "tool", "html": "Javascript, HTML/CSS" },
            { "html": "I participated in NUS Orbital, a programme where students had to propose, implement and complete a project. I decided to create Panopto Plus, a Chrome Extension that improved the UI of NUS webcasts, added transcripts and subtitles, silence trimming, volume boosting functionality and white noise reduction for these webcasts. These were performed without the use of an external server to ensure that the project will persist even without server support. <br><br> I used <a target='blank' href='https://preactjs.com/'>PreactJS</a> to speed up some parts of the UI implementation. I implemented the subtitles and transcripts by leveraging on Panopto's own servers (cached upon retrieval to minimize load). The silence trimming was implemented with <a target='blank' href='https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4142156/'> Double-Combined Fourier Transform</a> using Web Audio API & Web Workers to decode and process the TS files (Audio Worklets caused memory leaks for my use case). There were also various other features implemented to improve the webcasting experience.<br><br> Panopto Plus is free and it can be downloaded <a target='blank' href='https://chrome.google.com/webstore/detail/panopto-plus/akbikmmpkifiidiegdmhaancnfoeokbh'>here</a>. The project is open source, so you can also find it on GitHub <a target='blank' href='https://github.com/crazoter/panplus'>here</a>. Implementation / testing details can be found <a target='blank' href='https://docs.google.com/document/d/1SSKt7AarU6Eq0sDjX5Z_V_kLHgVvYx65-W42pP7GObI/edit'>here</a> and the project code is documented using JSDoc.<br><br>At the point of writing this extension has 150 users even though it was not really publicly promoted due to the difficulty of promoting it. The extension's silence trimming is extremely useful as it has regularly trimmed off a significant portion of lecture time (probably around 10-20%) without affecting my learning. I'm pretty happy that a small project I developed over the holidays is this useful to so many." }
        ]
    },
    {
        "main_icon": "medal",
        "title": "TrAVEl",
        "remark": "Press coverage by The Straits Times",
        "summary": "Polytechnic Final Year Project to help the visually impaired and elderly use public transport",
        "img": "assets/png/travel.png",
        "divs": [
            {
                "icon": "medal",
                "html": "<a target='_blank' href='http://www.straitstimes.com/singapore/transport/new-bus-app-for-visually-impaired-and-elderly-commuters'>Press coverage by The Straits Times</a>, Ngee Ann Polytechnic Outstanding Innovation Team Award (Student Excellence Award 2015)"
            },
            { "icon": "ppl", "html": "3 man team" },
            { "icon": "time", "html": "1 semester (~16 weeks)"},
            { "icon": "tool", "html": "Android (Java & XML), PHP"},
            { "html": "For my final year project, I decided to develop an Android mobile application that improves the lives of the less fortunate in my community. Together with 2 other like-minded individuals, Jeremy Lim and Jian Yu, we embarked on TrAVEl as our final year project.<br><br>TrAVEl is an Android application (app) to help the visually impaired and elderly navigate Singapore using public transport. It automatically plans the best route based on the starting and ending points provided. It provides real-time updates even if there are other apps running to ensure the user is kept updated on where he is, when the next bus is arriving and also informs the user when to board/alight the bus/train through notifications. The route is recalculated if the user missed the stop.<br><br>The user experience (UX) is both visually and aurally designed for the visually impaired and works well with Android accessibility features (e.g. Talkback) if necessary. There is also a help button at the same location on every page to guide users if they are disoriented. Testing was done with the visually impaired guides at Dialogue in the Dark (DID) to ensure satisfactory UX.<br><br>A key feature is the speech-to-text recognition of a large dataset of Singapore places such as Jurong East, Bishan or even Bukit Chandu which makes it a lot easier for visually impaired to use (compared to existing apps). The app is also able to recognise speakers with different accents and pronunciations of most Singapore locations.<br><br>The development of TrAVEl has also led to the creation of spinoff apps, such as a bus timing monitor for the Pebble smartwatch which is also visually impaired-friendly, and a bus location viewer which uses live data from users of TrAVEl to display the locations of buses. It has also been covered by The Straits Times and won our team the Ngee Ann Polytechnic Outstanding Innovation Team Award.<br><br>After our final year project, we have worked with Ngee Ann Polytechnic (NP) and DID to refine the application. Since then, the team has handed over the project to NP publish and provide maintenance.<br><br>I am very thankful to NP, my advisors and last but not least my team of friends who made this project a success. It is my wish that the application would be helpful to the visually impaired and elderly community, especially since I have friends and relatives who fall under these categories.<img class='work-content' src='assets/png/travel-team.png' alt='travel team image'><div class='caption'>The TrAVEl team & supervisors. From left: Mr. Henry Thet Swe, Matthew, Jeremy Lim, Jian Yu, Mr. Charles Keck. Not in photo: Mr. Andrew Tan, Mr. Ng Weng Choh</div>" }
        ]
    },
    {
        "main_icon": "medal",
        "title": "MeL Pentesting",
        "remark": "Blackboard Learn MeL Vulnerability",
        "summary": "Discovered and recommended countermeasures for vulnerabilities in NP's e-Learning portal as an assignment",
        "img": "assets/png/mel.png",
        "divs": [
            {
                "icon": "medal",
                "html": "One of the two games that won me the Unity Technologies Prize, Featured in graduation showcase"
            },
            { "icon": "ppl", "html": "2 man team" },
            { "icon": "time", "html": "1 month"},
            { "icon": "tool", "html": "JS, HTML/CSS, XSS"},
            { "html": "Me and two of my classmates discovered vulnerabilities in Ngee Ann Polytechnic’s (NP) E-learning portal, Blackboard Learn – Mel while working on a school assignment that required us to find vulnerabilities in any software / hardware.<br><br>Together with another classmate, I documented the vulnerabilities, developed proof-of-concept attacks and demonstrated them to our supervisor and NP’s administrative staff while recommending countermeasures. I'm not at liberty to elaborate on the vulnerabilities but they were severe enough such that they can be exploited to obtain the credentials of lecturers and other students easily. <br><br>This project taught me the value of IT security as I observed first-hand how one vulnerability (or a combination of vulnerabilities) can easily cause grievous harm to any organization. All of us definitely learnt not to be complacent; everyone had preconceptions that the system would be infallible before embarking on the assignment and we were shocked (and a little amused) when we discovered the vulnerabilities." }
        ]
    },
    {
        "main_icon": "case",
        "title": "Worked at PIXELSQUAD",
        "remark": "as a Full-Stack Developer",
        "summary": "Worked on Moter MegaMall & other projects",
        "img": "assets/png/pxs.png",
        "divs": [
            { "icon": "time", "html": "~5 months"},
            { "icon": "tool", "html": "Javascript & HTML/CSS (Vue.js, Sass, Angular 2), Typescript (Ionic & Cordova for Android & iOS), LAMP (CakePHP)"},
            { "icon": "case", "html": "<a target='blank' href='https://www.pixelsquad.com.sg/'>PIXELSQUAD</a>" },
            { "html": "Immediately after National Service (NS), I decided to work at PIXELSQUAD, a web development agency, as a full-stack developer. I worked on various projects that required me to develop the website and mobile applications. One such project was Motor MegaMall (MMM) which was an online portal for buying and selling cars (like sgCarMart). On top of helping to develop the front-end and backend as well as the mobile application for Android and iOS, I also developed an online image editor for users to hide their car plate numbers. MMM also had a service that allowed users to apply for car loans to various banks, but each of these banks had their own forms for applying for a loan. To combat this issue, I had to develop a system that automated the population of PDF fields of these forms, as well as automated the signing & stamping of these documents using signatures and stamps provided by the user.<br><br>I had learnt a lot during my time at PIXELSQUAD and I am grateful for the opportunity to work there." }
        ]
    },
    {
        "main_icon": "case",
        "title": "Six",
        "remark": "App that combines Tinder with LinkedIn (start-up)",
        "summary": "Developed a high fidelity prototype on iOS with Swift 2.0 & Objective-C and MEAN stack with features like 2FA auth",
        "img": "assets/png/six.png",
        "divs": [
            { "icon": "ppl", "html": "2 man team" },
            { "icon": "time", "html": "~1 year"},
            { "icon": "tool", "html": "iOS (Swift, Objective-C), MEAN, 2FA (Twilio)"},
            { "icon": "case", "html": "Six" },
            { "html": "As I was serving National Service (NS) as a clerk, I wanted to do something with my free time. That was when I met Sean, a like-minded individual who also wanted to make good use of his free time during NS. It was then that the two of us founded a start-up; our goal was to create an application that would combine Tinder and LinkedIn together such that you could meet and connect with other talented people for projects and work. I handled the technical aspects of the start-up while he managed the business aspect. The two of us designed the application together and I created the mobile application and setup the server from scratch. We managed to produce a high-fidelity prototype, but I had become too busy with new NS duties after up pes and decided drop the project after experiencing burnout." }
        ]
    },
    {
        "main_icon": "case",
        "title": "SOWS",
        "remark": "E-commerce website in 3 weeks (start-up)",
        "summary": "A brief experience working pro bono at a start-up",
        "img": "assets/png/sows.png",
        "divs": [
            { "icon": "ppl", "html": "2 man team" },
            { "icon": "time", "html": "3 weeks"},
            { "icon": "tool", "html": "Javascript & HTML/CSS (Bootstrap), PHP & MySQL (Laravel)"},
            { "icon": "case", "html": "Save Our World Services" },
            { "html": "Save Our World Services, or SOWS for short, is an online portal for services and products by companies in Singapore.<br><br>Together with another full stack developer, we revamped their existing website and content management system (CMS) using Bootstrap as our front-end framework and Laravel as the back-end framework.<br><br>Because the start-up company was undergoing a business overhaul, much of their existing website and CMS had to be scrapped; everything had to be redesigned and recreated from scratch.<br><br>The project was fraught with scope creep and changes, so much so that the founder of SOWS personally apologized for it. Fortunately, me and my colleague managed to pull through. We had delivered:<ul>  <li>    A relatively clean and responsive online portal that acts as a listing for services. Users can login to rate / favourite services, while companies can update their profile as listed services are linked to an existing company in the system.  </li>  <li>    A content management system for the business' employees to be used for managing the services listed on the portal.  </li></ul>We had also created an online messaging system similar to Web Telegram within 2 days and implemented an API for a mobile version of the portal but these features was removed due to scope change.<br><br>I am proud to say that the founder of SOWS was very satisfied with our work and astounded by our work ethic considering that we were unlikely to (and did not) get paid for our efforts.<br><br>All in all, it was a very tough experience because we had to rush so much work out in so little time but I learnt a lot through the process and from my colleague on both front-end and back-end development." }
        ]
    },
    {
        "main_icon": "case",
        "title": "Also Can!",
        "remark": "English to Singlish translator (Ngee Ann Polytechnic)",
        "summary": "Crowdsourced machine learning to parse vocal Singlish",
        "img": "assets/png/ac.png",
        "divs": [
            { "icon": "ppl", "html": "1 man team" },
            { "icon": "time", "html": "1 month"},
            { "icon": "tool", "html": "Android (Java & XML)"},
            { "icon": "case", "html": "Ngee Ann Polytechnic" },
            { "html": "Also Can! is a English to Singlish translator mobile application developed for Ngee Ann Polytechnic. This application syncs the Singlish dictionary with a server so that when a translation is corrected by one user, other users also get the improvement. There is a versioning system which allows the admin easily remove/ignore entries that they believe are spam. <br><br>A few years ago it could be downloaded <a target='_blank' href='https://play.google.com/store/apps/details?id=np.alsocan'>here</a> on the Google Play Store, but it has since been removed after it has become defunct." }
        ]
    },
    {
        "main_icon": "paint",
        "title": "Dynalite",
        "remark": "IoT project to visualize & analyse room vacancy",
        "summary": "",
        "img": "assets/png/dyn.png",
        "divs": [
            { "icon": "ppl", "html": "4 man team" },
            { "icon": "tool", "html": "Python 3, CoAP, MEAN with PostgreSQL, React" },
            { "html": "Together with a few other teamates from NUS, I developed a web-app that dynamic visualisation of room occupancy using IoT devices.<br><br>Dynalite was built using 3 Docker containers and Raspberry Pi (RPi) GPIO for my CS3103 Computer Networks Practice module. The RPi reads light data, encrypts the information and then sends it via CoAP to the first Docker container containing a backend NodeJS-ExpressJS web server.<br><br>The backend server verifies the information and stores the measurements into a PostgreSQL database. This information is then displayed on a website detailing when the room is available and for how long using React.<br><br>I contributed to the IoT portion of the project which involved programming in Python 3 and managing the encryption between Python & Node.js.<br><br>The project can be found <a target='blank' href='https://github.com/DigiPie/dynalite'>here</a>." }
        ]
    },
    {
        "main_icon": "paint",
        "title": "CarParkour",
        "remark": "Carpark vacancy mobile app",
        "summary": "One of the first mobile applications for finding vacant carparks in Singapore",
        "img": "assets/png/cpkr.png",
        "divs": [
            { "icon": "ppl", "html": "2 man team" },
            { "icon": "tool", "html": "Android, PHP" },
            { "html": "Inspired by a friend's complaint that it was hard to find vacant carpark lots, I created CarParkour with my friend Jeremy Lim. CarParkour helped Singaporean drivers find carpark lots in Orchard and the CBD, wherever data is available. In tandem with data from government APIs, it uses a predictive algorithm to estimate the number of lots 10 minutes into the future and colour-codes carparks, saving drivers the effort of rerouting to another carpark if their destination is full. Additionally, it displays all HDB carparks and some commercial carparks, along with parking fees for selected locations. This app was made with Jeremy Lim under the Collab 08 banner. After official apps were released, CarParkour was no longer needed and has since been sunseted." }
        ]
    },
    {
        "main_icon": "case",
        "title": "Photobooth",
        "remark": "Photo booth software (Ngee Ann Polytechnic)",
        "summary": "Software include photobooth & display screen for photos taken",
        "img": "assets/png/pb.png",
        "divs": [
            { "icon": "ppl", "html": "4 man team" },
            { "icon": "time", "html": "4 weeks"},
            { "icon": "tool", "html": "Javascript, HTML/CSS, PHP (laravel)"},
            { "icon": "case", "html": "Ngee Ann Polytechnic" },
            { "html": "I was hired by Ngee Ann Polytechnic (NP) with a group of other students to develop Photobooth, a web application that allows the user to take a photo of himself, frame it (from a wide range of frames) and give it a caption (which can be dragged to position it). The web application is usable on a computer, tablet or a mobile phone. The photo taken will then be displayed on a large screen for everyone to see.<br><br>Photobooth was used by NP School of ICT for Open House 2015. It was very satisfying to see the software run without a hitch on the day itself and to see everyone using it without complaints. To see their faces light up in amusement as their faces appeared on the screen was very fulfilling." }
        ]
    },
    {
        "main_icon": "medal",
        "title": "GRPG",
        "remark": "A Generic RPG",
        "summary": "An rpg similar to runescape classic developed in 3 weeks",
        "img": "assets/png/grpg.png",
        "divs": [
            {
                "icon": "medal",
                "html": "One of the two games that won me the Unity Technologies Prize, Featured in graduation showcase"
            },
            { "icon": "ppl", "html": "3 man team" },
            { "icon": "time", "html": "3 weeks"},
            { "icon": "tool", "html": "C++ DirectX"},
            { "html": "For a games development school assignment, I developed a parody of Runescape Classic with 2 classmates. Features include fishing, cooking, mining, trading, equipment, eating, map generation, mob generation, fighting and quite a number more such as quests.<br><br>The game basically leads the player from one quest to another, ultimately culminating in a boss fight with a dragon." }
        ]
    },
    {
        "main_icon": "medal",
        "title": "The King's Hand",
        "remark": "A 3D stealth archery game using GameMaker",
        "summary": "Developed in 2 weeks without prior GML or 3D programming experience in a team of 2",
        "img": "assets/png/tkh.png",
        "divs": [
            {
                "icon": "medal",
                "html": "One of the two games that won me the Unity Technologies Prize, Featured in graduation showcase"
            },
            { "icon": "ppl", "html": "2 man team" },
            { "icon": "time", "html": "2 weeks"},
            { "icon": "tool", "html": "GameMaker:Studio Standard (Java)"},
            { "html": "My first exposure to 3D game development, I created a 3D game using GameMaker with a classmate. Features missions, relatively realistic archery (takes wind and heartbeat into account), skills etc.<br><br>This was despite the fact that I had little to no prior experience with either 3D game development nor GameMaker Studio and that we were expected (and advised) to only develop a 2D game.<br><br>I had wanted to develop a 3D game to challenge myself as I had already done various other 2D games previously and also because I also believed that the game idea of archery simulation would be better served with a 3D perspective than a 2D perspective.<br><br>It was tremendously satisfying when we surpassed everyone's expectations with the quality of the game, especially considering we did it so quickly and with all the GameMaker quirks." }
        ]
    },
    {
        "main_icon": "medal",
        "title": "Little Strike",
        "remark": "A 2D multiplayer top down shooter",
        "summary": "Developed in 2 weeks in a team of 2",
        "img": "assets/png/ls.png",
        "divs": [
            {
                "icon": "medal",
                "html": "Featured in graduation showcase"
            },
            { "icon": "ppl", "html": "2 man team" },
            { "icon": "time", "html": "2 weeks"},
            { "icon": "tool", "html": "Windows Form Application (C#)"},
            { "html": "Me and one of my classmates decided to take our Windows Application Development assignment to the next level and we created a multiplayer top-down shooter (which can support up to at least 8 players). It has multiple classes (specializations) with different abilities (such as turning invisible) and weapons and various other features like scoreboards, primitive map editor etc. Delta timing was also implemented to ensure smooth gameplay.<br><br>This assignment was especially memorable as we were the only team that conducted a live playtest when we were presenting to the lecturer and the class. Seeing everyone enjoying our creation made all the effort worth it." }
        ]
    },
    {
        "main_icon": "medal",
        "title": "Splash Wars",
        "remark": "2nd runners up in Splash Awards 2012",
        "summary": "A personal achievement, as the game was developed in 2 weeks without prior C# Silverlight experience",
        "img": "assets/png/sw.png",
        "divs": [
            {
                "icon": "medal",
                "html": "2nd runners up in Splash Awards 2012"
            },
            { "icon": "ppl", "html": "3 man team" },
            { "icon": "time", "html": "2 weeks"},
            { "icon": "tool", "html": "Silverlight (C#)"},
            { "html": "During my first semester at Ngee Ann Polytechnic, I joined the Splash Awards competition with two classmates. As nobody in the team had any prior C# knowledge (and we only had a bit of coding practice), I had to learn C# and build a game with Silverlight in 2 weeks from scratch on my own. My effort paid off and we clinched the 2nd runners up position.<br><br>In addition to learning C# and winning 3rd place, the experience was unforgettable as it was a personal life lesson on the value of passion, focus and determination. The game was on the Windows App Store <a target='_blank' href='https://www.microsoft.com/en-us/store/games/splashwarsii/9nblggh08w11'>here</a>, but has since been taken down after so many years have passed." }
        ]
    },
    {
        "main_icon": "paint",
        "title": "Bookshelf",
        "remark": "Web app to keep track of reading material",
        "summary": "By indexing and summarizing what they read, users are better able to remember the finer points of useful articles.",
        "img": "assets/png/bs.png",
        "divs": [
            { "icon": "ppl", "html": "1 man team" },
            { "icon": "tool", "html": "Javascript, HTML/CSS" },
            { "html": "Bookshelf is a responsive web application created for users to keep track of what they read, or to take notes. What it does is it allows the user to summarize their reading material and tag them for future reference. Or they can just tag them for future reading. The main idea is to provide a platform for the user to keep track of what he reads and allow him to make notes / summarize if he wishes so that he can remember the more important points better.<br><br>Bookshelf has various features:<ul>  <li>CMS for articles; add, edit, delete, search by tag/date/title/content, pagination etc</li>  <li>Uses Material Design (by Materializecss, but animations are changed to use CSS to provide smoother animation on mobile)</li>  <li>Responsive</li>  <li>Other little usability nuggets like automatically populating the add article input fields upon pasting in the article URL (e.g. filling in the title & description with the page's meta tags), Markdown for description/summary etc.</li></ul>Bookshelf is now defunct as it relied on Parse as its CMS which stopped its service on 2017.<img class='work-content' src='assets/png/bs-ct.png'><div class='caption'>Bookshelf landing page with all sorts of tagged articles</div><img class='work-content' src='assets/png/bs-ct2.png'><div class='caption'>An example of an article's summary, complemented with the use of Markdown</div>" }
        ]
    },
    {
        "main_icon": "paint",
        "title": "Scenery Traveller",
        "remark": "Travel the world from your home",
        "summary": "Complete with an editor",
        "img": "assets/png/ess.png",
        "divs": [
            { "icon": "ppl", "html": "1 man team" },
            { "icon": "time", "html": "3 weeks"},
            { "icon": "tool", "html": "Javascript, HTML/CSS" },
            { "html": "Imagine yourself standing in front of the world's grandest scenery. In front of the grand canyon. In lush forests. Accompanied with music.<br><br>Scenery Traveller teleports you from your home into the beautiful parts of the world, as if you are there amongst the foliage, or at the top of a mountain. This application allowed you to edit an image of a person online, choose a music video and grabbed sceneries from r/earthporn for the backdrop. The editor used Imgur as a backend: the edited image of the person would be uploaded as the image and metadata was uploaded as the description. However, as the Imgur API may have changed somewhat since, it is unlikely the project is still functioning. <br><br>Demo: <a href='https://crazoter.github.io/Scenery-Traveller/scenery_slideshow.html?id=4ojMLPg'>https://crazoter.github.io/Scenery-Traveller/scenery_slideshow.html?id=4ojMLPg</a><br>Editor: <a href='http://crazoter.github.io/Scenery-Traveller-Editor/editor.html'>http://crazoter.github.io/Scenery-Traveller-Editor/editor.html</a><br><br>More at the GitHub repository for this project:<div class='github-widget' data-repo='crazoter/Scenery-Traveller'></div><br>An editor for this project is also available at this GitHub repository:<div class='github-widget' data-repo='crazoter/Scenery-Traveller-Editor'></div><br><br><div class='caption'>As you might have guessed, this project was originally a very elaborate joke</div>" }
        ]
    },
    {
        "main_icon": "paint",
        "title": "Photoshop Work",
        "remark": "Feat. Mr Anand",
        "summary": "60+ high res. images of Mr. Anand's face in various movie posters (lol)",
        "img": "assets/png/pp.png",
        "divs": [
            { "icon": "tool", "html": "Photoshop" },
            { "html": "During web development class, me and a few friends discovered a security vulnerability in a website belonging to our lecturer which he was using as an example. This vulnerability allowed us to change the image on the website and we thought it was a great idea to photoshop our lecturer's face into a movie poster and put it on the website.<br><br> I started photoshopping his face onto various movie posters, and this snowballed into an entire photoshop portfolio of 60+ posters featuring him, Mr. Anand Ravi Deshpande. The full portfolio can be found at <a target='_blank' href='http://tinyurl.com/photos-of-mr-anand'>http://tinyurl.com/photos-of-mr-anand</a>.<br><br>Note: This was a harmless prank on a website used for purely educational purposes; Mr. Anand was greatly amused and not insulted by the prank. On our graduation day, we gifted him a collage poster of these photoshopped images with our signatures, much to his and our amusement." }
        ]
    },
    {
        "main_icon": "paint",
        "title": "Speak Me Not",
        "remark": "Virtual Microphone using Google Translate",
        "summary": "Speak to your friends in Google Translate's voice using text (CLI or GUI, Windows using Google Translate & VLC)",
        "img": "assets/png/smn.png",
        "divs": [
            { "icon": "ppl", "html": "1 man team" },
            { "icon": "time", "html": "3 weeks"},
            { "icon": "tool", "html": "C++, VLC, VB Cable"},
            { "html": "I created this Windows application because I wanted to \"talk\" to my friends while playing CS:GO, yet I did not have a microphone. I thought it would be cool (and funny) to speak to them in Google Translate; just hit a hotkey, type my message and play a voice sound file obtained from Google's Speech-to-Text API through a virtual mic using VLC. <br><br>More at the GitHub repository for this project:<div class=\"github-widget\" data-repo=\"crazoter/Speak-Me-Not\"></div><br>Note: This project is now defunct due to lack of updates and changes to the Google Speech-to-Text API." }
        ]
    },
    {
        "main_icon": "paint",
        "title": "Form Doer",
        "remark": "A suite of scripts that automate the filling of online forms",
        "summary": "Features include randomized input using regex, probabilities for radio buttons/checkboxes etc.",
        "img": "assets/png/fd.png",
        "divs": [
            { "icon": "ppl", "html": "1 man team" },
            { "icon": "tool", "html": "Javascript, HTML/CSS"},
            { "html": "A suite of scripts to automate the filling of online forms such as Google Forms, SurveyMonkey etc. Allows me to randomize results by regex, set percentages for MCQs etc...<br><br>As you may suspect, these scripts were not made public because these scripts have the power to perform Denial Of Service (DOS) attacks on a form and can easily render any form's data useless in a few seconds (especially for SurveyMonkey; a DOS on SurveyMonkey would take less than a second because it enforces a limit of 30 survey results for a free account).<br><br>These scripts were developed for experimental purposes only and have only been used on sample forms. They have since been rendered defunct due to lack of updates and changes to the websites." }
        ]
    }
]